---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.ShapeFailure
source: html/4d3eba00-9c8b-cd0d-c33b-3ae2145d1eda.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.ShapeFailure Property

The displayed Rebar Shape is created using a 'Rebar Bar for Preview'. This bar defines the bend radius displayed in the family. Using this preview bar the drawn shape cannot be completed.

## Syntax (C#)
```csharp
public static FailureDefinitionId ShapeFailure { get; }
```